content/blog/exp-report-basecamp.md
+++
title = "Experience Report: Using Basecamp as a Remote team"
author = ["Vedang Manerikar"]
lastmod = 2020-08-22T18:04:33+05:30
tags = ["tools", "communication", "collaboration", "teams", "project-management"]
categories = ["tools"]
draft = true
creator = "Emacs 28.0.50 (Org mode 9.3.7 + ox-hugo)"
+++

## Good things {#good-things}

-   Onboarding was beautiful. As a software dev, I learnt a lot about
    how to do this well.
    -   Templates to help you set up teams and projects.
    -   Videos explaining the basics.
    -   The account login choice (between Google login and email/password
        login) was limited, but the switch was seamless.
-   Automatic check-ins are great!
    -   The interface and ux is intuitive and makes it easy to follow-up /
        collate / discuss updates across time and / or multiple people.
-   Todos and scheduling is cool!
    -   I like the UX, need to spend more time playing with these features
        to understand +/- points.


## Bad things {#bad-things}

-   Campfire
    -   No ability to instantly modify your status.
        -   I want to let people know what I'm doing. Examples:
            -   "Bathroom Break"
            -   "AFK for lunch"
            -   "On the phone"
        -   For a tool helping remote employees, this seems like a big miss.
    -   No ability to add reactions in Campfire. Coming from Slack, this
        is a huge step back in the "fun" component.
-   Docs and Files
    -   Writing in Basecamp is not substantially better or different from
        writing in Confluence. I had expected that Basecamp would support
